package com.lianglu.weyue.model;

/**
 * Created by Liang_Lu on 2017/12/12.
 */

public class ChapterContentBean {


    /**
     * ok : true
     * chapter : {"title":"第1章 1.并非幸存者，而是赢家","body":" 请安装最新版追书 以便使用优质资源","isVip":false,"currency":10,"id":"5a015d83e4ea49bd3ff38f64","created":"2017-11-07T07:15:15.445Z","updated":"2017-11-07T07:15:15.445Z","cpContent":"屋外是伸手不见五指的黑暗，只有翻滚浓黑的乌云间突兀闪过的紫红色冷厉闪电，才堪堪有了一丝光亮。 　　大雨滂沱。 　　屋内同样黑暗。 　　不过与屋外不同的是，屋内有一名长相可人的美少女正皱着秀眉，一脸严肃的看着手机的屏幕之上。 　　少女叫肖云云，她正在打游戏，打的游戏正是现下火热非常的推塔类竞技游戏\u2014\u2014王者荣耀。 　　王者荣耀这门手游，除了推塔组队5v5这样的特色外，还拥有各种各样外形美观的英雄以及皮肤，像是男同志们们，都偏爱刺客坦克等英雄，而女孩子们，都喜爱美观的射手法师类英雄。 　　但肖云云却是大大的不同。 　　她操控的不是法师射手，而是坦克程咬金，搭配上他爱与正义那红配绿的辣眼睛的皮肤，真是怎么看怎么猥琐。 　　忽然这时，手机屏幕上突然蹦出来一道紫色身影，将程咬金的红给打了。 　　肖云云脸色一黑。 　　发现抢她红的人，正是王者峡谷颜值很高的李白\u2014\u2014千年狐。 　　李白在抢了她的红后，竟然还嚣张无比的挥舞着他飘逸的剑法给她看。 　　肖云云气极，忽然邪邪一笑，她开始在屏幕上打字。 　　程咬金：嗯哼！李白哥哥你打人家的红红！小金金不开心了！ 　　李白的身形顿了一顿，然后走开，并不搭理她。 　　可少女是什么样的人呢？ 　　调戏的人越冷淡，她越开心。 　　这是典型的抖m。 　　程咬金：李白哥哥～你个渣男～昨天还在床上跟人家缠绵，说不要跟小金金分离，今天就翻脸了！ 　　李白终于淡定不了了。 　　李白：你好好说话，不要这么恶心。 　　程咬金：哭唧唧，你昨晚可不是这么说的，你不是最喜欢人家这个腔调吗？ 　　李白被恶心到了，干脆话也不多说，直接将所有的大招都落在了程咬金身上，直接将肖云云的4-1-5战绩刷到了4-10-6。 　　肖云云干脆不动了，操控着程咬金认他打，李白没打一下，她就要多打几个字。 　　程咬金：哦！好舒服，李白哥哥求再重一点。 　　程咬金：哦～嗯～就是那里！李白哥哥人家真爱你。 　　最后直接逼得李白那方投降。 　　看着屏幕上显示的胜利字样，肖云云那精致的小脸露出得意的笑容。 　　这已经不是肖云云第一次干这件事了。 　　她是个青铜小渣渣，手速不行，技术更是渣到不行，用女性最偏爱的法师射手角色，只会从头送到尾。 　　于是肖云云剑走偏锋，开始玩上了廉颇程咬金这种坦克。 　　就像是突然打开了异世界的大门，肖云云发现，坦克不仅可以作为肉盾，不容易死，更是拥有堪比核武器一样威力。 　　就像这次一样，肖云云的恶心别人技能已经修炼到极致。 　　遇到赵云韩信等射手法师天敌，肖云云照样是不带怕的，即便前期对方碾压我方，肖云云一出手，调戏他们直到对方子乱阵脚，照样最后还是赢了。 　　肖云云打完这一局就退出了游戏，她看着窗外电闪雷鸣，放下手机，就躺在柔软又舒服的大床之上，准备睡觉。 　　因此闭着眼睛的肖云云并没有发现，手机屏幕自动亮了。 　　只见屏幕之上，浮现几道俊美非旦的身影。 　　韩信，李白，赵云，周瑜等王者峡谷颜值担当齐聚一堂，他们开始讨论着什么。 　　李白轻佻一笑，眼里闪过戏谑之意，邪魅逼人：\u201c这个少女，有点意思。\u201d 　　韩信冰冷的面容快速的闪过一丝动容，他开口：\u201c嗯。\u201d 　　赵云慢慢擦拭着长枪：\u201c你们想要怎么做？\u201d 　　周瑜温和一笑，\u201c以其人之道还治其人之身，如何？\u201d 　　其他人点点头。 　　讨论完一切后，屏幕又诡异的变暗。 　　当然，早已陷入沉睡的肖云云什么也感受不到。 　　因为她的梦境太奇特了。 　　亦假亦真，她也分不清是现实还是在梦里。 　　她出现在一片纯白空间之中，这里没有丝毫人气。 　　肖云云眉毛皱起，眼里闪过狐疑，就四处看了看。 　　可仍旧不见任何生物。 　　肖云云不解。 　　就在这时，空间中突然升起一道声音。 　　\u201c叮！恭喜宿主绑定【强撩黑化男神】系统，系统君520为您服务。\u201d 　　what？ 　　\u201c谁在说话？\u201d肖云云眼睛微眯，警惕的望着四周。 　　\u201c我是系统君啊，宿主您已经绑定了【强撩黑化男神】系统，因此必须完成系统所设下的任务哦，否则的话\u2026\u2026\u201d 　　肖云云追问道：\u201c否则什么？\u201d 　　系统君邪恶一笑：\u201c否则，就惩罚宿主一辈子都被程咬金廉颇那样的调戏哦。\u201d 　　肖云云眉梢一挑：\u201c那又如何？\u201d 　　这有什么可怕的，实在不行直着妖妖灵。 　　系统君仿佛是感知倒了肖云云的想法，又是笑道：\u201c那就罚你被程咬金廉颇囚禁哦～绝对让别人找不到你哦～\u201d 　　肖云云想想那场面，顿时打了个哆嗦。 　　\u201c那做任务失败，会不会有什么惩罚。\u201d 　　\u201c有哦。\u201d系统君微微一笑：\u201c惩罚同样哦。\u201d 　　肖云云：\u201c\u2026\u2026\u201d 　　感情这是让她毫无退路啊。 　　肖云云一咬牙：\u201c好，想让我答应你，必须答应我一个条件。\u201d 　　系统君：\u201c是什么？\u201d 　　肖云云眼中算计一闪而过：\u201c我要每个世界都有一次求助的机会。\u201d 　　\u201c好～没问题。\u201d系统君很爽快的答应了，\u201c鉴于本系统名叫【强撩黑化男神】系统，所以宿主，您的任务就是1.想尽办法让目标黑化。2.让黑化目标再次爱上您。加油哦～宿主，本系统相信你没问题。\u201d 　　肖云云：\u201c呵呵。\u201d 　　怪不得系统答应的这么爽快，原来是藏着这么大的一个坑啊。 　　系统君又欢快的道：\u201c那么宿主，您即将穿越的世界是《爱上青丘之王》，这是您的基本信息。 　　宿主：肖云云。 　　性别：女 　　穿越人物：青丘国丞相之女，妲己 　　任务技能：1.灵魂冲剂：0级未解锁。 　　2.偶像魅力：0级未解锁。 　　3.女王崇拜：0级未解锁。 　　现在穿越开始～请宿主接受好世界信息以及目标任务的信息哦～么么哒。\u201d 　　么么哒你妹！ 　　肖云云在昏迷前一刻时这样想着。"}
     */

    private boolean ok;
    private ChapterBean chapter;

    public boolean isOk() {
        return ok;
    }

    public void setOk(boolean ok) {
        this.ok = ok;
    }

    public ChapterBean getChapter() {
        return chapter;
    }

    public void setChapter(ChapterBean chapter) {
        this.chapter = chapter;
    }

    public static class ChapterBean {
        /**
         * title : 第1章 1.并非幸存者，而是赢家
         * body :  请安装最新版追书 以便使用优质资源
         * isVip : false
         * currency : 10
         * id : 5a015d83e4ea49bd3ff38f64
         * created : 2017-11-07T07:15:15.445Z
         * updated : 2017-11-07T07:15:15.445Z
         * cpContent : 屋外是伸手不见五指的黑暗，只有翻滚浓黑的乌云间突兀闪过的紫红色冷厉闪电，才堪堪有了一丝光亮。 　　大雨滂沱。 　　屋内同样黑暗。 　　不过与屋外不同的是，屋内有一名长相可人的美少女正皱着秀眉，一脸严肃的看着手机的屏幕之上。 　　少女叫肖云云，她正在打游戏，打的游戏正是现下火热非常的推塔类竞技游戏——王者荣耀。 　　王者荣耀这门手游，除了推塔组队5v5这样的特色外，还拥有各种各样外形美观的英雄以及皮肤，像是男同志们们，都偏爱刺客坦克等英雄，而女孩子们，都喜爱美观的射手法师类英雄。 　　但肖云云却是大大的不同。 　　她操控的不是法师射手，而是坦克程咬金，搭配上他爱与正义那红配绿的辣眼睛的皮肤，真是怎么看怎么猥琐。 　　忽然这时，手机屏幕上突然蹦出来一道紫色身影，将程咬金的红给打了。 　　肖云云脸色一黑。 　　发现抢她红的人，正是王者峡谷颜值很高的李白——千年狐。 　　李白在抢了她的红后，竟然还嚣张无比的挥舞着他飘逸的剑法给她看。 　　肖云云气极，忽然邪邪一笑，她开始在屏幕上打字。 　　程咬金：嗯哼！李白哥哥你打人家的红红！小金金不开心了！ 　　李白的身形顿了一顿，然后走开，并不搭理她。 　　可少女是什么样的人呢？ 　　调戏的人越冷淡，她越开心。 　　这是典型的抖m。 　　程咬金：李白哥哥～你个渣男～昨天还在床上跟人家缠绵，说不要跟小金金分离，今天就翻脸了！ 　　李白终于淡定不了了。 　　李白：你好好说话，不要这么恶心。 　　程咬金：哭唧唧，你昨晚可不是这么说的，你不是最喜欢人家这个腔调吗？ 　　李白被恶心到了，干脆话也不多说，直接将所有的大招都落在了程咬金身上，直接将肖云云的4-1-5战绩刷到了4-10-6。 　　肖云云干脆不动了，操控着程咬金认他打，李白没打一下，她就要多打几个字。 　　程咬金：哦！好舒服，李白哥哥求再重一点。 　　程咬金：哦～嗯～就是那里！李白哥哥人家真爱你。 　　最后直接逼得李白那方投降。 　　看着屏幕上显示的胜利字样，肖云云那精致的小脸露出得意的笑容。 　　这已经不是肖云云第一次干这件事了。 　　她是个青铜小渣渣，手速不行，技术更是渣到不行，用女性最偏爱的法师射手角色，只会从头送到尾。 　　于是肖云云剑走偏锋，开始玩上了廉颇程咬金这种坦克。 　　就像是突然打开了异世界的大门，肖云云发现，坦克不仅可以作为肉盾，不容易死，更是拥有堪比核武器一样威力。 　　就像这次一样，肖云云的恶心别人技能已经修炼到极致。 　　遇到赵云韩信等射手法师天敌，肖云云照样是不带怕的，即便前期对方碾压我方，肖云云一出手，调戏他们直到对方子乱阵脚，照样最后还是赢了。 　　肖云云打完这一局就退出了游戏，她看着窗外电闪雷鸣，放下手机，就躺在柔软又舒服的大床之上，准备睡觉。 　　因此闭着眼睛的肖云云并没有发现，手机屏幕自动亮了。 　　只见屏幕之上，浮现几道俊美非旦的身影。 　　韩信，李白，赵云，周瑜等王者峡谷颜值担当齐聚一堂，他们开始讨论着什么。 　　李白轻佻一笑，眼里闪过戏谑之意，邪魅逼人：“这个少女，有点意思。” 　　韩信冰冷的面容快速的闪过一丝动容，他开口：“嗯。” 　　赵云慢慢擦拭着长枪：“你们想要怎么做？” 　　周瑜温和一笑，“以其人之道还治其人之身，如何？” 　　其他人点点头。 　　讨论完一切后，屏幕又诡异的变暗。 　　当然，早已陷入沉睡的肖云云什么也感受不到。 　　因为她的梦境太奇特了。 　　亦假亦真，她也分不清是现实还是在梦里。 　　她出现在一片纯白空间之中，这里没有丝毫人气。 　　肖云云眉毛皱起，眼里闪过狐疑，就四处看了看。 　　可仍旧不见任何生物。 　　肖云云不解。 　　就在这时，空间中突然升起一道声音。 　　“叮！恭喜宿主绑定【强撩黑化男神】系统，系统君520为您服务。” 　　what？ 　　“谁在说话？”肖云云眼睛微眯，警惕的望着四周。 　　“我是系统君啊，宿主您已经绑定了【强撩黑化男神】系统，因此必须完成系统所设下的任务哦，否则的话……” 　　肖云云追问道：“否则什么？” 　　系统君邪恶一笑：“否则，就惩罚宿主一辈子都被程咬金廉颇那样的调戏哦。” 　　肖云云眉梢一挑：“那又如何？” 　　这有什么可怕的，实在不行直着妖妖灵。 　　系统君仿佛是感知倒了肖云云的想法，又是笑道：“那就罚你被程咬金廉颇囚禁哦～绝对让别人找不到你哦～” 　　肖云云想想那场面，顿时打了个哆嗦。 　　“那做任务失败，会不会有什么惩罚。” 　　“有哦。”系统君微微一笑：“惩罚同样哦。” 　　肖云云：“……” 　　感情这是让她毫无退路啊。 　　肖云云一咬牙：“好，想让我答应你，必须答应我一个条件。” 　　系统君：“是什么？” 　　肖云云眼中算计一闪而过：“我要每个世界都有一次求助的机会。” 　　“好～没问题。”系统君很爽快的答应了，“鉴于本系统名叫【强撩黑化男神】系统，所以宿主，您的任务就是1.想尽办法让目标黑化。2.让黑化目标再次爱上您。加油哦～宿主，本系统相信你没问题。” 　　肖云云：“呵呵。” 　　怪不得系统答应的这么爽快，原来是藏着这么大的一个坑啊。 　　系统君又欢快的道：“那么宿主，您即将穿越的世界是《爱上青丘之王》，这是您的基本信息。 　　宿主：肖云云。 　　性别：女 　　穿越人物：青丘国丞相之女，妲己 　　任务技能：1.灵魂冲剂：0级未解锁。 　　2.偶像魅力：0级未解锁。 　　3.女王崇拜：0级未解锁。 　　现在穿越开始～请宿主接受好世界信息以及目标任务的信息哦～么么哒。” 　　么么哒你妹！ 　　肖云云在昏迷前一刻时这样想着。
         */

        private String title;
        private String body;
        private boolean isVip;
        private int currency;
        private String id;
        private String created;
        private String updated;
        private String cpContent;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getBody() {
            return body;
        }

        public void setBody(String body) {
            this.body = body;
        }

        public boolean isIsVip() {
            return isVip;
        }

        public void setIsVip(boolean isVip) {
            this.isVip = isVip;
        }

        public int getCurrency() {
            return currency;
        }

        public void setCurrency(int currency) {
            this.currency = currency;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getCreated() {
            return created;
        }

        public void setCreated(String created) {
            this.created = created;
        }

        public String getUpdated() {
            return updated;
        }

        public void setUpdated(String updated) {
            this.updated = updated;
        }

        public String getCpContent() {
            return cpContent;
        }

        public void setCpContent(String cpContent) {
            this.cpContent = cpContent;
        }
    }
}
